### Pandas

*   Open source Python package
*   Provides high-performance, easy-to-use data structures and data analysis tool

### Basic Unit of Pandas

<ol>
<li>Series - one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.</li>
<li>Dataframes- two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns - dataframe shall be collection of series</li>
</ol>

In [ ]:
import pandas as pd
import numpy as np

### Creating a Dataframe

#### From a list of lists

In [ ]:
data = [['Abinav',95],['Radha',87],['Kumar',98],['Amutha',71],['Ramesh',63]]

In [ ]:
marks_df = pd.DataFrame(data,columns=['Name','Marks'])

In [ ]:
marks_df

     Name  Marks
0  Abinav     95
1   Radha     87
2   Kumar     98
3  Ramesh     63
4  Amutha     71

#### Take transpose of a dataframe

In [ ]:
marks_df.T

            0      1      2       3       4
Name   Abinav  Radha  Kumar  Ramesh  Amutha
Marks      95     87     98      63      71

In [ ]:
type(marks_df)

pandas.core.frame.DataFrame

In [ ]:
type(marks_df['Name'])

pandas.core.series.Series

#### From Two Lists using Zip

In [ ]:
Names = ['Abinav','Radha','Kumar','Amutha','Ramesh']
Marks = [95,87,98,71,63]

In [ ]:
marks_df = pd.DataFrame(list(zip(Names,Marks)),columns=['Name','Marks'])

In [ ]:
marks_df

     Name  Marks
0  Abinav     95
1   Radha     87
2   Kumar     98
3  Amutha     71
4  Ramesh     63

#### From dict of narray/lists

In [ ]:
data = {'Name':['Abinav','Radha','Kumar','Amutha','Ramesh'],'Marks':[95,87,98,71,63]}

In [ ]:
marks_df = pd.DataFrame(data)

In [ ]:
marks_df

     Name  Marks
0  Abinav     95
1   Radha     87
2   Kumar     98
3  Amutha     71
4  Ramesh     63

#### From a lists of dictionaries

In [ ]:
data = [{'Name':'Abinav','Marks':95}, {'Name':'Radha','Marks':87},{'Name':'Kumar','Marks':98},{'Name':'Ramesh','Marks':63},{'Name':'Amutha','Marks':71}]

In [ ]:
marks_df = pd.DataFrame(data)

In [ ]:
marks_df

     Name  Marks
0  Abinav     95
1   Radha     87
2   Kumar     98
3  Ramesh     63
4  Amutha     71